app/controllers/crews_controller.rb

SELECT * FROM "crews" WHERE ("crews"."id" = 1)
---
  def show
    @crew = Crew.find(params[:id])

SELECT * FROM "crews" WHERE ("crews"."id" = 2)
---
  def edit
    @crew = Crew.find(params[:id])

SELECT * FROM "crews" WHERE ("crews"."id" = 1)
UPDATE "crews" SET "updated_at" = '2010-01-31 14:25:41', "decription" = 'Als Abspaltung der "Konrad-Zuse" gründete sich am Donnerstag dem 23.07.09 ab 20 Uhr eine neue Crew mit dem groben lokalen Bezug Pankow-Weißensee in dem Grell Eck (Grellstr. 1, 10409 Berlin). Gut gestärkt mir Currywurst und Bierchen ging es in die Vorstellungsrunde. Der klare Favorit Negroponte, Begründer des One Laptop per Child Projekts, wurde einstimmig zum Crewnamen gewählt. ', "homepage" = 'http://wiki.piratenpartei.de/BE:Crews/Negroponte' WHERE "id" = 1
---
  def update
    @crew = Crew.find(params[:id])

    respond_to do |format|
      if @crew.update_attributes(params[:crew])