app/controllers/landesverbands_controller.rb

SELECT * FROM "landesverbands" WHERE ("landesverbands"."id" = 1)
---
  def show
    @landesverband = Landesverband.find(params[:id])

SELECT * FROM "landesverbands" WHERE ("landesverbands"."id" = 1)
---
  def edit
    @landesverband = Landesverband.find(params[:id])

INSERT INTO "landesverbands" ("name", "decription", "created_at", "updated_at", "partei_id", "homepage") VALUES('Berlin', '', '2010-01-30 18:23:01', '2010-01-30 18:23:01', 1, 'http://berlin.piratenpartei.de')
---
  def create
    @landesverband = Landesverband.new(params[:landesverband])

    respond_to do |format|
      if @landesverband.save