app/controllers/nodes_controller.rb

SELECT sum("scores".score) AS sum_score FROM "scores" WHERE (node_id = 1)
---
  def index
    @nodes = Node.find(:all,  :select => "nodes.*, SUM(scores.score) AS score",
                :joins => :scores, :group => 'nodes.id' )

SELECT * FROM "nodes" WHERE ("nodes"."id" = 0)
---
  def show
    @node = Node.find(params[:id])

SELECT * FROM "nodes" WHERE (node_id = '1a') LIMIT 1
SELECT * FROM "crews" WHERE (name = 'Negroponte') LIMIT 1
INSERT INTO "crews" ("name", "decription", "created_at", "updated_at", "homepage", "landesverband_id") VALUES('Negroponte', NULL, '2010-01-30 19:12:25', '2010-01-30 19:12:25', NULL, NULL)
---
  def status
  	 if !params[:node_id] || !params[:rev] || !(/^[0-9a-f]{32}$/.match(params[:node_id]))
  	 	flash[:warning] = 'Update fehlgeschlagen<br />Interner Fehler: Datenbank nicht erreichbar.<br /> Bitte versuchen Sie es später noch einmal.'
      redirect_to :action => "index"
      return
  	 end

  	#check for node
  	@node = Node.find(:first, :conditions => ['node_id = ?', params[:node_id]])

  	if !@node
  		#new node creation
  		@node = Node.new

  		#params saved for update
  		@node.node_id = params[:node_id]
  		@node.rev = params[:rev]

  		#params saved for informations
  		if params[:name] && params[:lat] && params[:lon] && params[:crew] && params[:lv] && params[:partei]
  			@node.name = params[:name]
  			@node.lat = params[:lat]
  			@node.lon = params[:lon]

  			#create crew, if necessary
  			if !(crew = Crew.find(:first, :conditions => ['name = ?', params[:crew].capitalize]))
   				crew = Crew.new
  				crew.name = params[:crew].capitalize
  				crew.save

SELECT * FROM "landesverbands" WHERE (name = 'Berlin') LIMIT 1
---
  			@node.crew_id = crew.id

  			#create lv, if necessary
  			if !(lv = Landesverband.find(:first, :conditions => ['name = ?', params[:lv].capitalize]))

SELECT * FROM "parteis" WHERE (id = '1') LIMIT 1
---
  				lv.save
  			end
  			@node.landesverband_id = lv.id
  			@node.partei_id = Partei.find(:first, :conditions => ['id = ?', params[:partei]])

INSERT INTO "nodes" ("name", "lon", "created_at", "neighboors_count", "rev", "updated_at", "node_id", "clients_count", "partei_id", "crew_id", "last_seen", "landesverband_id", "lat") VALUES('snake', 21312.12312312312, '2010-01-31 00:28:15', 3, '105055040', '2010-01-31 00:28:15', '1asdq23a555', 6, 1, 2, '2010-01-31 00:28:15', 1, 12.123123123)
UPDATE "nodes" SET "updated_at" = '2010-01-30 21:37:25', "neighboors_count" = 3, "clients_count" = 6, "crew_id" = 1, "name" = 'cheater', "partei_id" = 1, "lon" = 21312.12312312312, "lat" = 12.123123123, "landesverband_id" = 1 WHERE "id" = 4
---

 			#save node entry
 			@node.last_seen = Time.now
 			@node.save

INSERT INTO "scores" ("created_at", "updated_at", "node_id", "variant", "score") VALUES('2010-01-30 21:31:01', '2010-01-30 21:31:01', 4, 0, 100)
---
 			initial_score.variant = 0
 			initial_score.score = 100
 			initial_score.node_id = @node.id
 			initial_score.save

SELECT * FROM "nodes" WHERE ("nodes"."id" = 6)
DELETE FROM "nodes" WHERE "id" = 6
---
  def destroy
    @node = Node.find(params[:id])
    @node.destroy