app/controllers/parteis_controller.rb

  def show
    @partei = Partei.find(params[:id])
---
SELECT * FROM "parteis" WHERE ("parteis"."id" = 1)

  def edit
    @partei = Partei.find(params[:id])
---
SELECT * FROM "parteis" WHERE ("parteis"."id" = 1)

  def create
    @partei = Partei.new(params[:partei])

    respond_to do |format|
      if @partei.save
---
INSERT INTO "parteis" ("name", "decription", "created_at", "updated_at", "homepage") VALUES('Piratenpartei Deutschland', 'Die Piratenpartei setzt sich für einen stärkeren Schutz und eine stärkere Beachtung der Grundrechte ein und will die Bürgerrechte gegenüber dem sie bedrohenden Staat bzw. dessen Einrichtungen verteidigen. Wir stehen hinter dem Grundgesetz in der grundsätzlichen Form, wie es 1949 ausgearbeitet wurde. Insbesondere lehnen wir Änderungen an den Grundrechten (Art.1 bis 19, GG) kategorisch ab, da die Vergangenheit gezeigt hat, dass diese immer nur zu einem Abbau von Bürgerrechten führen.', '2010-01-30 18:10:09', '2010-01-30 18:10:09', 'http://www.piratenpartei.de')